Autodesk.Revit.DB.IFamilyLoadOptionsProxy.OnSharedFamilyFound(Autodesk.Revit.DB.Family,System.Boolean,Autodesk.Revit.DB.FamilySource@,System.Boolean@)
A method called when the shared family was found in the target document.
Remarks:
Triggered only when the family is both loaded and changed.
sharedFamily:
The shared family in the current family document.
familyInUse:
Indicates if one or more instances of the family is placed in the project.
source:
This indicates if the family will load from
the project or the current family.
overwriteParameterValues:
This indicates whether or not to overwrite the parameter
values of existing types.
Returns:
Return true to continue loading the family, false to cancel.

Autodesk.Revit.DB.IFamilyLoadOptionsProxy.OnFamilyFound(System.Boolean,System.Boolean@)
A method called when the family was found in the target document.
Remarks:
Triggered only when the family is both loaded and changed.
familyInUse:
Indicates if one or more instances of the family is placed in the project.
overwriteParameterValues:
This determines whether or not to overwrite the parameter
values of existing types. The default value is false.
Returns:
Return true to continue loading the family, false to cancel.